FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_EMAC.c
/*-------------------------------------------------------------------------*
 * File:  RX62N_EMAC.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the RX62N EMAC (Ethernet) Driver.
 * Implementation:
 *
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZ License.pdf or visit http://goo.gl/UDtTCR for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(r) to your own hardware!   |
 *    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <Config.h>
#include <uEZTypes.h>
#include <uEZProcessor.h>
#include <HAL/EMAC.h>
#include <uEZBSP.h>
#include <stdio.h>
#include "RX62N_UtilityFuncs.h"
#include "RX62N_EMAC.h"

/*---------------------------------------------------------------------------*
 * Options:
 *---------------------------------------------------------------------------*/
#ifndef DEBUG_RX62N_EMAC_STARTUP
#define DEBUG_RX62N_EMAC_STARTUP  0
#endif

#ifndef DEBUG_RX62N_EMAC_RX_DESC
#define DEBUG_RX62N_EMAC_RX_DESC  0
#endif

/*---------------------------------------------------------------------------*
 * Constants:
 *---------------------------------------------------------------------------*/
/* DP83848C PHY Registers */
#define PHY_REG_BMCR        0x00        /* Basic Mode Control Register       */
#define PHY_REG_BMSR        0x01        /* Basic Mode Status Register        */
#define PHY_REG_IDR1        0x02        /* PHY Identifier 1                  */
#define PHY_REG_IDR2        0x03        /* PHY Identifier 2                  */
#define PHY_REG_ANAR        0x04        /* Auto-Negotiation Advertisement    */
#define PHY_REG_ANLPAR      0x05        /* Auto-Neg. Link Partner Abitily    */
#define PHY_REG_ANER        0x06        /* Auto-Neg. Expansion Register      */
#define PHY_REG_ANNPTR      0x07        /* Auto-Neg. Next Page TX            */

/* PHY Extended Registers */
#define PHY_REG_STS         0x10        /* Status Register                   */
#define PHY_REG_MICR        0x11        /* MII Interrupt Control Register    */
#define PHY_REG_MISR        0x12        /* MII Interrupt Status Register     */
#define PHY_REG_FCSCR       0x14        /* False Carrier Sense Counter       */
#define PHY_REG_RECR        0x15        /* Receive Error Counter             */
#define PHY_REG_PCSR        0x16        /* PCS Sublayer Config. and Status   */
#define PHY_REG_RBR         0x17        /* RMII and Bypass Register          */
#define PHY_REG_LEDCR       0x18        /* LED Direct Control Register       */
#define PHY_REG_PHYCR       0x19        /* PHY Control Register              */
#define PHY_REG_10BTSCR     0x1A        /* 10Base-T Status/Control Register  */
#define PHY_REG_CDCTRL1     0x1B        /* CD Test Control and BIST Extens.  */
#define PHY_REG_EDCR        0x1D        /* Energy Detect Control Register    */

#define PHY_FULLD_100M      0x2100      /* Full Duplex 100Mbit               */
#define PHY_HALFD_100M      0x2000      /* Half Duplex 100Mbit               */
#define PHY_FULLD_10M       0x0100      /* Full Duplex 10Mbit                */
#define PHY_HALFD_10M       0x0000      /* Half Duplex 10MBit                */
#define PHY_AUTO_NEG        0x3000      /* Select Auto Negotiation           */

/* BMSR setting */
#define BMSR_100BE_T4		0x8000
#define BMSR_100TX_FULL		0x4000
#define BMSR_100TX_HALF		0x2000
#define BMSR_10BE_FULL		0x1000
#define BMSR_10BE_HALF		0x0800
#define BMSR_AUTO_DONE		0x0020
#define BMSR_REMOTE_FAULT	0x0010
#define BMSR_NO_AUTO		0x0008
#define BMSR_LINK_ESTABLISHED	0x0004

/* Below is the Micrel PHY definition used for IAR LPC23xx and
 Embedded Artists LPC24xx board. */
#define MIC_PHY_RXER_CNT			0x0015
#define MIC_PHY_INT_CTRL			0x001B
#define MIC_PHY_LINKMD_CTRL			0x001D
#define MIC_PHY_PHY_CTRL			0x001E
#define MIC_PHY_100BASE_PHY_CTRL	0x001F

#define BASIC_MODE_CONTROL_REG      0
#define BASIC_MODE_STATUS_REG       1
#define PHY_IDENTIFIER1_REG         2
#define PHY_IDENTIFIER2_REG         3
#define AN_ADVERTISEMENT_REG        4
#define AN_LINK_PARTNER_ABILITY_REG 5
#define AN_EXPANSION_REG            6

/* Media Independent Interface */
#define  PHY_ST    1
#define  PHY_READ  2
#define  PHY_WRITE 1
//#define  PHY_ADDR  0x1F

#define  MDC_WAIT  2

/* PHY return definitions */
#define R_PHY_OK     0
#define R_PHY_ERROR -1

/* Auto-Negotiation Link Partner Status */
#define PHY_AN_LINK_PARTNER_100BASE 0x0180
#define PHY_AN_LINK_PARTNER_FULL    0x0140

/*
 *  Wait counter definitions of PHY-LSI initialization
 *  ICLK = 96MHz
 */
#define PHY_RESET_WAIT              0x00020000L
#define PHY_AUTO_NEGOTIATON_WAIT    0x00800000L

/* RX62N Descriptor and buffer configuration */
#define BUFSIZE   256                   /* Must be 32-bit aligned */
#define ENTRY     8                     /* Number of RX and TX buffers */

#define  ACT      0x80000000
#define  DL       0x40000000
#define  FP1      0x20000000
#define  FP0      0x10000000
#define  FE       0x08000000

#define  RFOVER   0x00000200
#define  RAD      0x00000100
#define  RMAF     0x00000080
#define  RRF      0x00000010
#define  RTLF     0x00000008
#define  RTSF     0x00000004
#define  PRE      0x00000002
#define  CERF     0x00000001

#define  TAD      0x00000100
#define  CND      0x00000008
#define  DLC      0x00000004
#define  CD       0x00000002
#define  TRO      0x00000001

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
struct Descriptor {
    __evenaccess TUInt32 status;
#if __LIT
    /* Little endian */
    __evenaccess TUInt16 size;
    __evenaccess TUInt16 bufsize;
#else
    /* Big endian */
    __evenaccess TUInt16 bufsize;
    __evenaccess TUInt16 size;

#endif
    TUInt8 *buf_p;
    struct Descriptor *next;
};

typedef struct Descriptor ethfifo;

struct enet_stats {
    TUInt32 rx_packets; /* total packets received    */
    TUInt32 tx_packets; /* total packets transmitted  */
    TUInt32 rx_errors; /* bad packets received      */
    TUInt32 tx_errors; /* packet transmit problems    */
    TUInt32 rx_dropped; /* no space in buffers      */
    TUInt32 tx_dropped; /* no space available      */
    TUInt32 multicast; /* multicast packets received  */
    TUInt32 collisions;

    /* detailed rx_errors: */
    TUInt32 rx_length_errors;
    TUInt32 rx_over_errors; /* receiver ring buffer overflow  */
    TUInt32 rx_crc_errors; /* recved pkt with crc error  */
    TUInt32 rx_frame_errors; /* recv'd frame alignment error  */
    TUInt32 rx_fifo_errors; /* recv'r fifo overrun      */
    TUInt32 rx_missed_errors; /* receiver missed packet    */

    /* detailed tx_errors */
    TUInt32 tx_aborted_errors;
    TUInt32 tx_carrier_errors;
    TUInt32 tx_fifo_errors;
    TUInt32 tx_heartbeat_errors;
    TUInt32 tx_window_errors;
};

struct ei_device {
    const TUInt8 *name;
    TUInt8 open;
    TUInt8 Tx_act;
    TUInt8 Rx_act;
    TUInt8 txing; /* Transmit Active */
    TUInt8 irqlock; /* EDMAC's interrupt disabled when '1'. */
    TUInt8 dmaing; /* EDMAC Active */
    ethfifo *rxcurrent; /* current receive discripter */
    ethfifo *txcurrent; /* current transmit discripter */
    TUInt8 save_irq; /* Original dev->irq value. */
    struct enet_stats stat;
    TUInt8 mac_addr[6];
};

