FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_EMAC.c
/******************************************************************************
 * Function Name: _phy_reg_write
 * Description  : Writes to PHY register through RMII/MII interface
 * Arguments    : data - value to write
 * Return Value : none
 ******************************************************************************/
void _phy_reg_write(TUInt16 data)
{
    TUInt32 i;

    i = 16;
    while (i > 0) {
        if ((data & 0x8000) == 0) {
            _phy_mii_write_0();
        } else {
            _phy_mii_write_1();
        }
        i--;
        data <<= 1;
    }
}

/******************************************************************************
 * Function Name: _phy_write
 * Description  : Writes to a PHY register
 * Arguments    : reg_addr - address of the PHY register
 *              : data - value
 * Return Value : none
 ******************************************************************************/
void _phy_write(TUInt16 phy_addr, TUInt16 reg_addr, TUInt16 data)
{
    _phy_preamble();
    _phy_reg_set(phy_addr, reg_addr, PHY_WRITE);
    _phy_ta_10();
    _phy_reg_write(data);
    _phy_ta_z0();
}

/******************************************************************************
 * Function Name: _phy_read
 * Description  : Reads a PHY register
 * Arguments    : reg_addr - address of the PHY register
 * Return Value : read value
 ******************************************************************************/
TUInt16 _phy_read(TUInt16 phy_addr, TUInt16 reg_addr)
{
    TUInt16 data;

    _phy_preamble();
    _phy_reg_set(phy_addr, reg_addr, PHY_READ);
    _phy_ta_z0();
 //   _phy_ta_z0();  (read off bits)
    _phy_reg_read(&data);
    _phy_ta_z0();

    return (data);
}

#if 0
/******************************************************************************
 * Function Name: phy_set_100full
 * Description  : Set Ethernet PHY device to 100 Mbps full duplex
 * Arguments    : none
 * Return Value : none
 ******************************************************************************/
void phy_set_100full(void)
{
    _phy_write(BASIC_MODE_CONTROL_REG, 0x2100);
}

/******************************************************************************
 * Function Name: phy_set_10half
 * Description  : Sets Ethernet PHY device to 10 Mbps half duplexR
 * Arguments    : none
 * Return Value : none
 ******************************************************************************/
void phy_set_10half(void)
{
    _phy_write(BASIC_MODE_CONTROL_REG, 0x0000);
}

/******************************************************************************
 * Function Name: phy_set_autonegotiate
 * Description  : Starts autonegotiate and reports the other side's
 *              : physical capability
 * Arguments    : none
 * Return Value : bit 8 - Full duplex 100 mbps
 *              : bit 7 - Half duplex 100 mbps
 *              : bit 6 - Full duplex 10 mbps
 *              : bit 5 - Half duplex 10 mbps
 *              : bit 4:0 - Always set to 00001 (IEEE 802.3)
 *              : -1 if error
 ******************************************************************************/
int16_t phy_set_autonegotiate(void)
{
    TUInt16 reg;
    TUInt32 count;

    _phy_write(AN_ADVERTISEMENT_REG, 0x01E1);
    _phy_write(BASIC_MODE_CONTROL_REG, 0x1200);

    count = 0;
    do {
        reg = _phy_read(BASIC_MODE_STATUS_REG);
        count++;
    }while (!(reg & 0x0020) && count < PHY_AUTO_NEGOTIATON_WAIT);

    if (count >= PHY_AUTO_NEGOTIATON_WAIT) {
        return R_PHY_ERROR;
    } else {
        return ((int16_t)_phy_read(AN_LINK_PARTNER_ABILITY_REG));
    }
}
#endif

#if 0
/******************************************************************************
 * Function Name: phy_init
 * Description  : Resets Ethernet PHY device
 * Arguments    : none
 * Return Value : none
 ******************************************************************************/
int16_t phy_init(void)
{
    TUInt16 reg;
    TUInt32 count;

    /* Reset PHY */
    _phy_write(BASIC_MODE_CONTROL_REG, 0x8000);
    count = 0;
    do {
        reg = _phy_read(BASIC_MODE_CONTROL_REG);
        count++;
    }while ((reg & 0x8000) && (count < PHY_RESET_WAIT));

    if (count >= PHY_RESET_WAIT) {
        return R_PHY_ERROR;
    } else {
        return R_PHY_OK;
    }
}
#endif

/******************************************************************************
 * Function Name: _eth_fifoInit
 * Description  : Initialize E-DMAC descriptors
 * Arguments    : p - pointer to descriptor
 *              : status - initial status of descriptor
 * Return Value : none
 ******************************************************************************/
void _eth_fifoInit(ethfifo p[], TUInt32 status)
{
    ethfifo *current = 0;
    TUInt32 i, j;

    for (i = 0; i < ENTRY; i++) {
        current = &p[i];

        if (status == 0) {
            current->buf_p = &txbuf[i][0];
        } else {
            current->buf_p = &rxbuf[i][0];
        }

        /* Clear buffer */
        for (j = 0; j < BUFSIZE; j++) {
            current->buf_p[j] = 0;
        }
        current->bufsize = BUFSIZE;
        current->size = 0;
        current->status = status;
        current->next = &p[i + 1];
    }

    /* Set the last fifo entry to complete the loop */
    current->status |= DL;
    current->next = &p[0];
}

/******************************************************************************
 * Function Name: _eth_fifoWrite
 * Description  : Transmits data and updates E-DMAC descriptor
 * Arguments    : p - pointer to descriptor
 *              : buf - pointer to data to transmit
 *              : size - number of data bytes
 * Return Value : Number of bytes written to transmit buffer for this descriptor
 *              : -1 Descriptor busy
 ******************************************************************************/
TInt32 _eth_fifoWrite(ethfifo *p, TUInt8 buf[], TUInt32 size)
{
    TInt32 i;
    ethfifo *current = p;

    if ((current->status & ACT) != 0) {
        /**
         * Current descriptor is active and ready to transmit or transmitting.
         **/
        return (-1);
    }

