FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_EMAC.c
    // Turn on the EMAC
    SYSTEM.MSTPCRB.BIT.MSTPB15 = 0;

// TODO: Only supporting RMII Mode currently
    //#if ETH_MODE_SEL == ETH_RMII_MODE
    // Pin configuration (and enable Ethernet pins)
    /*  EE=1, PHYMODE=0, ENETE3=0, ENETE2=0, ENETE1=1, ENETE0=0 (Ethernet)  */
    IOPORT.PFENET.BYTE = 0x82;

    // Copy over the settings
    p->iSettings = *aSettings;

    /* Initialize driver */
    p->le0.open = 1;
    _eth_fifoInit(rxdesc, (TUInt32)ACT);
    _eth_fifoInit(txdesc, (TUInt32)0);
    p->le0.rxcurrent = &rxdesc[0];
    p->le0.txcurrent = &txdesc[0];
    p->le0.mac_addr[0] = p->iSettings.iMACAddress[0];
    p->le0.mac_addr[1] = p->iSettings.iMACAddress[1];
    p->le0.mac_addr[2] = p->iSettings.iMACAddress[2];
    p->le0.mac_addr[3] = p->iSettings.iMACAddress[3];
    p->le0.mac_addr[4] = p->iSettings.iMACAddress[4];
    p->le0.mac_addr[5] = p->iSettings.iMACAddress[5];

    /* Initialize EDMAC and ETHERC  */
    EDMAC.EDMR.BIT.SWR = 1;

    /* Reset EDMAC */
    for (i = 0; i < 0x00000100; i++) {
    }

    /* ETHERC */
    /* TODO:  Check bit 5 */
    ETHERC.ECSR.LONG = 0x00000037; /* clear all ETHERC status BFR, PSRTO, LCHNG, MPD, ICD */
    /* TODO:  Check bit 5 */
    ETHERC.ECSIPR.LONG = 0x00000020; /* disable ETHERC status change interrupt */
    ETHERC.RFLR.LONG = 1518; /* ether payload is 1500+ CRC              */
    ETHERC.IPGR.LONG = 0x00000014; /* Intergap is 96-bit time */

    mac_h = ((TUInt32)p->iSettings.iMACAddress[0] << 24)
            | ((TUInt32)p->iSettings.iMACAddress[1] << 16)
            | ((TUInt32)p->iSettings.iMACAddress[2] << 8)
            | (TUInt32)p->iSettings.iMACAddress[3];

    mac_l = ((TUInt32)p->iSettings.iMACAddress[4] << 8)
            | (TUInt32)p->iSettings.iMACAddress[5];

    if (mac_h == 0 && mac_l == 0) {
        /*
         * If 2nd parameter is 0, the MAC address should be acquired from the system,
         * depending on user implementation. (e.g.: EEPROM)
         */
    } else {
        ETHERC.MAHR = mac_h;
        ETHERC.MALR.LONG = mac_l;
    }

    /* EDMAC */
    EDMAC.EESR.LONG = 0x47FF0F9F; /* clear all ETHERC and EDMAC status bits */
    EDMAC.RDLAR = p->le0.rxcurrent; /* initialize Rx Descriptor List Address */
    EDMAC.TDLAR = p->le0.txcurrent; /* initialize Tx Descriptor List Address */
    EDMAC.TRSCER.LONG = 0x00000000; /* copy-back status is RFE & TFE only */
    EDMAC.TFTR.LONG = 0x00000000; /* threshold of Tx_FIFO */
    EDMAC.FDR.LONG = 0x00000707; /* transmit fifo & receive fifo is 2048 bytes */
    EDMAC.RMCR.LONG = 0x00000001; /* RR in EDRRR is under driver control */
#if __LIT
    EDMAC.EDMR.BIT.DE = 1;
#endif

	// Find the PHY address
    for (addr = 0; addr < 32; addr++) {
        p->iSettings.iPHYAddr = addr;
        v = IPHYRead(p, PHY_REG_IDR1);
#if DEBUG_RX62N_EMAC_STARTUP
        printf("ADDR: %d, v=%04X\n", addr, v);
#endif
        if (v != 0xFFFF) {
            break;
        }
    }
//p->iSettings.iPHYAddr = 1; //UEZ_EMAC_PHY_ADDR;
#if DEBUG_RX62N_EMAC_STARTUP
    printf("Addr: %d, Settings: %08X\n", addr, p->iSettings.iPHYAddr);
#endif


    /* Put the Phy in reset mode */
    IPHYWrite(p, PHY_REG_BMCR, 0x8000);
    UEZBSPDelayMS(1);

    // Wait for hardware reset to end.
    // We try 100 times with a 10 ms delay for a complete
    // time of 1 second.
    retry = 3;
    do {
        for (timeout = 0; timeout < 1000; timeout++) {
            UEZBSPDelayMS(1);
            regv = IPHYRead(p, PHY_REG_BMCR);
            if (!(regv & 0x8000)) {
                // Reset complete
                break;
            }
        }
#if DEBUG_RX62N_EMAC_STARTUP
        printf("regv=%04X\n", regv);
#endif
    } while ((timeout == 1000) && (--retry));

    if (!retry) {
        // report a timeout on the initialization
        return UEZ_ERROR_TIMEOUT;
    }

    // Setup PAUSE control (PAUSE and ASM_DIR in ANAR register)
    regv = IPHYRead(p, PHY_REG_ANAR);
#if DEBUG_RX62N_EMAC_STARTUP
    printf("pause regv=%04X\n", regv);
#endif
    IPHYWrite(p, PHY_REG_ANAR, regv | (1 << 10) | (1 << 11));

    uniqueID = (IPHYRead(p, PHY_REG_IDR1) << 16) | IPHYRead(p, PHY_REG_IDR2);

    switch (uniqueID) {
        case 0x20005C90: // National PHY
            error = IEMACConfigPHY_National(p);
            break;            
        case 0x20005CE1:    // National DP83640
            error = IEMACConfigPHY_NationalDSP83640(p);
            break;
        case 0x00221610: // Micrel 
        case 0x00221512: // Micrel KSZ8041TL-FTL
        case 0x0007C0F1: // SMSC LAN8720
#if DEBUG_RX62N_EMAC_STARTUP
            printf("Micrel init\n");
#endif
            error = IEMACConfigPHY_Micrel(p);
            break;
        default:
            // auto negotiation, restart AN
            // RE_AN should be self cleared
            IPHYWrite(p, PHY_REG_BMCR, PHY_AUTO_NEG);
            return UEZ_ERROR_NOT_SUPPORTED;
    }

    /* Enable receive and transmit */
    ETHERC.ECMR.BIT.RE = 1;
    ETHERC.ECMR.BIT.TE = 1;

    /* Enable EDMAC receive */
    EDMAC.EDRRR.LONG = 0x00000001;
    for (i = 0; i < 0x00000100; i++) {
    }

    return error;
}

static void IFrameError(T_RX62N_EMAC_Workspace *p)
{
    // Point to next frame and clear this descriptor.
    p->le0.stat.rx_errors++;

    p->le0.rxcurrent->status &= ~(FP1 | FP0 | FE);
    p->le0.rxcurrent->status &= ~(RFOVER | RAD | RMAF | RRF | RTLF | RTSF | PRE
            | CERF);
    p->le0.rxcurrent->status |= ACT;
    p->le0.rxcurrent = p->le0.rxcurrent->next;

    if (EDMAC.EDRRR.LONG == 0x00000000L) {
        // Restart if stopped
        EDMAC.EDRRR.LONG = 0x00000001L;
    }
}

#if DEBUG_RX62N_EMAC_RX_DESC
static void IOutputDescriptors(T_RX62N_EMAC_Workspace *p)
{
    int32_t i;
    ethfifo *p_entry;

    printf("\f======================\n");
    //ethfifo rxdesc[ENTRY];
    p_entry = rxdesc;
    for (i = 0; i < ENTRY; i++, p_entry++) {
        if (p_entry == p->le0.rxcurrent) {
            printf("--> ");
        } else {
            printf("    ");
        }
        printf("%08X: ", p_entry);
        if (p_entry->status & (1UL << 31))
            printf("RACT ");
        else
            printf("---- ");
        if (p_entry->status & (1 << 30))
            printf("RDLE ");
        else
            printf("---- ");
        if (p_entry->status & (1 << 29))
            printf("<ST> ");
        else
            printf("     ");
        if (p_entry->status & (1 << 28))
            printf("<ED> ");
        else
            printf("     ");
        if (p_entry->status & (1 << 27))
            printf("RFE (%03X) ", p_entry->status & 0x3FF);
        else
            printf("OK  (   ) ");

        printf("%4d/%4d\n", p_entry->size, p_entry->bufsize);
    }
}
#endif

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_EMAC_CheckFrameReceived
 *---------------------------------------------------------------------------*
 * Description:
 *      Determine if a frame has been received.
 * Inputs:
 *      void *aWorkspace          -- EMAC Controller's workspace
 * Outputs:
 *      TBool                     -- ETrue if frame received, else EFalse.
 *---------------------------------------------------------------------------*/
TBool RX62N_EMAC_CheckFrameReceived(void *aWorkspace)
{
    T_RX62N_EMAC_Workspace *p = (T_RX62N_EMAC_Workspace *)aWorkspace;
    p->iCurrent = p->le0.rxcurrent;

