FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_EMAC.c
    // more packets received ?
    // Is current descriptor active and ready to receive or receiving?
    // (in other words, not done)
    if ((p->iCurrent->status & ACT) != 0) {
        // Actively doing something, not ready
        return EFalse;
    }

    // The current descriptor is NOT active.
    // Did we have a frame error?
    if ((p->iCurrent->status & FE) != 0) {
        // Frame error
        IFrameError(p);
        return EFalse;
    }

#if DEBUG_RX62N_EMAC_RX_DESC
    IOutputDescriptors(p);
#endif

    // A descriptor is waiting to be processed
    return ETrue;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_EMAC_StartReadFrame
 *---------------------------------------------------------------------------*
 * Description:
 *      Reads the length of the received ethernet frame.  Returns the
 *      frame length.
 * Inputs:
 *      void *aWorkspace          -- EMAC Controller's workspace
 * Outputs:
 *      TUInt16                   -- Size of frame
 *---------------------------------------------------------------------------*/
TUInt16 RX62N_EMAC_StartReadFrame(void *aWorkspace)
{
    T_RX62N_EMAC_Workspace *p = (T_RX62N_EMAC_Workspace *)aWorkspace;
    TUInt32 temp_size;
    ethfifo *p_current;
    TUInt8 timeout;

    p_current = p->iCurrent = p->le0.rxcurrent;
    p->iCurrentByteIndex = 0;

    // Find the last entry
    while ((p_current->status & FP0) != FP0) {
        p_current = p_current->next;
        // Is this block ready?  Timeout after 5 ms
        timeout = 5;
        while (((p_current->status & ACT) != 0) && (timeout--)) {
            // NOTE: This delay sucks!  We should remove this
            // with an interrupt driven way later.
            UEZBSPDelayMS(1);
        }
    }

    // Return the complete size (lwIP breaks into blocks)
    temp_size = p_current->size;
#if DEBUG_RX62N_EMAC_RX_DESC
    printf("\n\nRead Start: %d\n", temp_size);
#endif
    // Track the total frame size
    p->iFrameByteSize = temp_size;
    p->iFrameByteIndex = 0;

    // Is this the last block of the frame chunks?
    if ((p->iCurrent->status & FP0) == FP0) {
        // Yes, it is.  Use this size
        p->iCurrentByteSize = p->iCurrent->size;
    } else {
        // Otherwise, we'll be a complete block in size
        p->iCurrentByteSize = BUFSIZE;
    }

    // Return the length of the current frame
    return (TUInt16)temp_size;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_EMAC_EndReadFrame
 *---------------------------------------------------------------------------*
 * Description:
 *      End the last frame.
 * Inputs:
 *      void *aWorkspace          -- EMAC Controller's workspace
 *---------------------------------------------------------------------------*/
void RX62N_EMAC_EndReadFrame(void *aWorkspace)
{
#if DEBUG_RX62N_EMAC_RX_DESC
    IOutputDescriptors((T_RX62N_EMAC_Workspace *)aWorkspace);
#endif
    // Do nothing in this driver
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_EMAC_RequestSend
 *---------------------------------------------------------------------------*
 * Description:
 *      Requests space in EMAC memory for storing an outgoing frame
 * Inputs:
 *      void *aWorkspace          -- EMAC Controller's workspace
 *---------------------------------------------------------------------------*/
void RX62N_EMAC_RequestSend(void *aWorkspace)
{
    // Do nothing for now
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_EMAC_DoSend
 *---------------------------------------------------------------------------*
 * Description:
 *      Send the frame
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 *      TUInt16 aFrameSize          -- Size of frame
 *---------------------------------------------------------------------------*/
void RX62N_EMAC_DoSend(void *aWorkspace, TUInt16 aFrameSize)
{
    // Do nothing for now (it really happens in CopyToFrame)
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_EMAC_CopyToFrame
 *---------------------------------------------------------------------------*
 * Description:
 *      Copies bytes from MCU-memory to frame port
 *      NOTES:
 *        - an odd number of byte may only be transfered
 *                  if the frame is written to the end!
 *        - MCU-memory MUST start at word-boundary
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 *      void *aSource               -- Location of data to send
 *      TUInt32 aSize               -- Number of bytes to send
 *---------------------------------------------------------------------------*/
void RX62N_EMAC_CopyToFrame(void *aWorkspace, void *aSource, TUInt32 aSize)
{
    TUInt8 *p_data = (TUInt8 *)aSource;
    TUInt32 flag = FP1; // Start of frame
    TInt32 transmitted;
    T_RX62N_EMAC_Workspace *p = (T_RX62N_EMAC_Workspace *)aWorkspace;

#if DEBUG_RX62N_EMAC_RX_DESC
    printf("  CopyToFrame: %d\n", aSize);
#endif
    for (transmitted = 0; aSize > 0; aSize -= (TUInt32)transmitted) {
        while (1) {
            // Setup one block worth of data
            transmitted = _eth_fifoWrite(p->le0.txcurrent, p_data, aSize);
            if (transmitted >= 1)
                break;
        }

        // Is this the last of the data?  If so, mark it as last
        if (transmitted == aSize)
            flag |= FP0;

        // Clear previous setetings and make active
        p->le0.txcurrent->status &= ~(FP1 | FP0);
        p->le0.txcurrent->status |= (flag | ACT);

        // Setup next flag and next section moving to next
        // data to be sent
        flag = 0;
        p->le0.txcurrent = p->le0.txcurrent->next;
        p_data += transmitted;
    }

    // Sent another packet
    p->le0.stat.tx_packets++;

