FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_EMAC.c
    if (EDMAC.EDTRR.LONG == 0x00000000)
        EDMAC.EDTRR.LONG = 0x00000001;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_EMAC_CopyFromFrame
 *---------------------------------------------------------------------------*
 * Description:
 *      Copies bytes from frame port to MCU-memory
 *      NOTES:
 *          - an odd number of byte may only be transfered
 *              if the frame is read to the end!
 *          - MCU-memory MUST start at word-boundary
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 *      void *aDestination          -- Location to store data
 *      TUInt32 aSize               -- Number of bytes to copy
 *---------------------------------------------------------------------------*/
void RX62N_EMAC_CopyFromFrame(
        void *aWorkspace,
        void *aDestination,
        TUInt32 aSize)
{
    T_RX62N_EMAC_Workspace *p = (T_RX62N_EMAC_Workspace *)aWorkspace;
    TUInt8 *p_dest = aDestination;
    TBool isCopying = ETrue;
    TUInt8 timeout;

#if DEBUG_RX62N_EMAC_RX_DESC
    IOutputDescriptors(p);
    printf("CopyFromFrame: size: %d\n", aSize);
    printf("  index: %d, size: %d\n", p->iCurrentByteIndex, p->iCurrentByteSize);
    printf("  findex: %d, fsize: %d\n", p->iFrameByteIndex, p->iFrameByteSize);
#endif
    while (isCopying) {
        // Is this block ready?  If not, wait for up to 5 ms
        timeout = 5;
        while (((p->iCurrent->status & ACT) != 0) && (timeout--)) {
            // NOTE: This delay sucks!  We should remove this
            // with an interrupt driven way later.
            UEZBSPDelayMS(1);
        }
        // Abort if the timeout failed
        if (timeout == 0)
            break;

        // Copy over a byte
        *(p_dest++) = p->iCurrent->buf_p[p->iCurrentByteIndex++];
        p->iFrameByteIndex++;
        if ((p->iCurrentByteIndex >= p->iCurrentByteSize)
                || (p->iFrameByteIndex >= p->iFrameByteSize)) {
            // If we have reached the end of this descriptor's block OR we have
            // just plain reached the end of the frame, move to the next
            // descriptor block.

            // Was this the end?
            if ((p->iCurrent->status & FP0) == FP0) {
                p->le0.stat.rx_packets++;
                isCopying = EFalse;
#if DEBUG_RX62N_EMAC_RX_DESC
                printf("--End frame\n");
#endif
                } else {
                // More data to go, setup the length again
                p->iCurrentByteIndex = 0;
                p->iCurrentByteSize = BUFSIZE;
#if DEBUG_RX62N_EMAC_RX_DESC
                printf("--End desc\n");
#endif
                }

            // Clear the flags for start/end and set to active again
            p->le0.rxcurrent->status &= ~(FP1 | FP0);
            p->le0.rxcurrent->status |= ACT;
            // Next block please
            p->iCurrent = p->le0.rxcurrent = p->le0.rxcurrent->next;

            // Restart EDMAC if stopped
            if (EDMAC.EDRRR.LONG == 0x00000000L) {
                /* Restart if stopped */
                EDMAC.EDRRR.LONG = 0x00000001L;
            }
        }
        // Decrement the number of bytes needed.
        // Regardless of the above, if we got all the bytes we
        // wanted, stop looping here.
        aSize--;
        if (aSize == 0)
            break;
    }
}

/*---------------------------------------------------------------------------*
 * HAL Interface table:
 *---------------------------------------------------------------------------*/
const HAL_EMAC RX62N_EMAC_Interface = {
        "RX62N:EMAC",
        0x0100,
        RX62N_EMAC_InitializeWorkspace,
        sizeof(T_RX62N_EMAC_Workspace),

        RX62N_EMAC_Configure,
        RX62N_EMAC_CheckFrameReceived,
        RX62N_EMAC_StartReadFrame,
        RX62N_EMAC_EndReadFrame,
        RX62N_EMAC_RequestSend,
        RX62N_EMAC_DoSend,
        RX62N_EMAC_CopyToFrame,
        RX62N_EMAC_CopyFromFrame,
};

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void RX62N_100_EMAC_RMII_Require()
{
    static const T_uezGPIOPortPin pins[] = {
        	GPIO_PB5,  	// RMII_TXD0
			GPIO_PB6,	// RMII_TXD1
			GPIO_PB4,  	// RMII_TXD_EN
			GPIO_PB7,	// RMII_CRS_DV
			GPIO_PB1,  	// RMII_RXD0
			GPIO_PB0,	// RMII_RXD1
			GPIO_PB3,	// RMII_RX_ER
			GPIO_PB2,  	// REF50CK
			GPIO_PA4,  	// ET_MDC
			GPIO_PA3,  	// ET_MDIO
			GPIO_PA5,  	// ET_LINKSTA
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("EMAC", (T_halInterface *)&RX62N_EMAC_Interface, 0, 0);
	RX62N_PinsLock(pins, ARRAY_COUNT(pins));
	
    // Turn on the EMAC
    SYSTEM.MSTPCRB.BIT.MSTPB15 = 0;

    #if 0
	/*  PA5=1 Set ET_LINKSTA input  */
    PORTA.ICR.BIT.B5 = 1;
//    PORTA.DDR.BIT.B5 = 1; // output
    /*  PA3=1 Set ET_MDIO input */
    PORTA.ICR.BIT.B3 = 1;
//    PORTA.DDR.BIT.B3 = 1; // output
    
    /* PB0=1 Set RMII_RXD1 input    */
    PORTB.ICR.BIT.B0 = 1;
    /* PB1=1 Set RMII_RXD0 input    */
    PORTB.ICR.BIT.B1 = 1;
    /* PB2=1 Set REF50CLK input */
    PORTB.ICR.BIT.B2 = 1;
    /* PB3=1 Set RMII_RX_ER input   */
    PORTB.ICR.BIT.B3 = 1;
    /* PB7=1 Set RMII_CRS_DV input  */
    PORTB.ICR.BIT.B7 = 1;

//PORTA.DDR.BYTE = 0xFF;
//PORTA.DR.BYTE = 0x00;
//PORTA.PORT.BYTE = 0x38;
//PORTB.DDR.BYTE = 0x70;
//PORTB.DR.BYTE = 0x00;
//PORTB.PORT.BYTE = 0x00;
//    PORTB.DDR.BYTE = 0x70;
//    PORTB.ICR.BYTE = 0x8F; // Turn on the input buffers on these pins
#else
    PORT0.DDR.BYTE = 0x00;                                      /* P0 Ether IRQ inputs.                                             */

    PORTA.DR.BYTE  = 0x00;                                      /* PA outputs all LOW to start.                                     */
    PORTA.DDR.BYTE = 0xFF;                                      /* PA: Expansion (PA0-PA2), Ether (PA3-PA5), Audio (PA6-PA7).       */

