FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_EMAC.c
//PORTB.DR.BYTE  = 0x01;  // Force RMII_RXD1 to high to change address of PHY
//PORTB.DR.BYTE  = 0x00;  // Force RMII_RXD1 (PB0) and RMII_RXD0 (PB1) to zero
//PORTB.DDR.BYTE = 0x73;                                      // PB: Ether.                                                       */

    PORTC.DR.BYTE  = 0xF7;                                      // PC: CS, clk = high; IO reset = low (not reset, Ether PHY).       */
    PORTC.DDR.BYTE = 0x7F;                                      // PC: SPI (PC0-2, PC4-7), IO reset (PC3).                          */

//UEZBSPDelayMS(50);
    PORTB.DR.BYTE  = 0x00;
    PORTB.DDR.BYTE = 0x70;                                      // PB: Ether.                                                       */

    // RMII
    IOPORT.PFENET.BYTE = 0x82;                         /* EE=1, PHYMODE=0, ENETE3=0, ENETE2=0, ENETE1=1, ENETE0=0 (Ether)  */

    PORTA.ICR.BIT.B5 = 1;                              /* PA5=1 Set ET_LINKSTA input                                       */
    PORTA.ICR.BIT.B3 = 1;                              /* PA3=1 Set ET_MDIO input                                          */
    PORTB.ICR.BIT.B0 = 1;                              /* PB0=1 Set RMII_RXD1 input                                        */
    PORTB.ICR.BIT.B1 = 1;                              /* PB1=1 Set RMII_RXD0 input                                        */
    PORTB.ICR.BIT.B2 = 1;                              /* PB2=1 Set REF50CLK input                                         */
    PORTB.ICR.BIT.B3 = 1;                              /* PB3=1 Set RMII_RX_ER input                                       */
    PORTB.ICR.BIT.B7 = 1;                              /* PB7=1 Set RMII_CRS_DV input                                      */
#endif
}

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void RX62N_176_EMAC_RMII_Require()
{
    static const T_uezGPIOPortPin pins[] = {
        	GPIO_P81,  	// RMII_TXD0
			GPIO_P82,	// RMII_TXD1
			GPIO_P80,  	// RMII_TXD_EN
			GPIO_P83,	// RMII_CRS_DV
			GPIO_P75,  	// RMII_RXD0
			GPIO_P74,	// RMII_RXD1
			GPIO_P77,	// RMII_RX_ER
			GPIO_P76,  	// REF50CK
			GPIO_P72,  	// ET_MDC
			GPIO_P71,  	// ET_MDIO
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("EMAC", (T_halInterface *)&RX62N_EMAC_Interface, 0, 0);
	RX62N_PinsLock(pins, ARRAY_COUNT(pins));
	
	/*  P54=1 Set ET_LINKSTA input  */
    PORT5.ICR.BIT.B4 = 1;
    /*  P71=1 Set ET_MDIO input */
    PORT7.ICR.BIT.B1 = 1;
    /* P74=1 Set RMII_RXD1 input    */
    PORT7.ICR.BIT.B4 = 1;
    /* P75=1 Set RMII_RXD0 input    */
    PORT7.ICR.BIT.B5 = 1;
    /* P76=1 Set REF50CLK input */
    PORT7.ICR.BIT.B6 = 1;
    /* P77=1 Set RMII_RX_ER input   */
    PORT7.ICR.BIT.B7 = 1;
    /* P83=1 Set RMII_CRS_DV input  */
    PORT8.ICR.BIT.B3 = 1;
}

/*-------------------------------------------------------------------------*
 * End of File:  EMAC.c
 *-------------------------------------------------------------------------*/
